src/cf/Reports/ГрафикОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ГрафикОтпусков</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/ОтпускаСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтпускаСотрудников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Reports/ГрафикОтпусков/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СформироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.ОтпускаСотрудников КАК ОтпускаСотрудников
	|ГДЕ
	|	ОтпускаСотрудников.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать(); 
	
	ДиаграммаГанта.ОтображатьЛегенду = Ложь; 
	ДиаграммаГанта.Очистить();
	Серия = ДиаграммаГанта.Серии.Добавить();
	Серия.Текст = "Отпуск";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		ЗначениеДГ = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = ЗначениеДГ.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ДатаНачала;
		Интервал.Конец = КонецДня(ВыборкаДетальныеЗаписи.ДатаОкончания);
		
	КонецЦикла;
		
КонецПроцедуры
